["What’s your unpopular sex opinion?", "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/", [["ieknight", 1353, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvudf3/", "Women need to communicate better.\nMany of my partners have liked guys taking control and going for it in the bedroom. I've had an ex I didn't end up having sex with who got pissed that despite all her teasing I never pinned her down and fucked her.\nNope. No. Not fair. We live in a world where you've made it abundantly clear that no means no and silence isn't consent. It's now your responsibility as a woman to communicate that you want to be fucked. I've never not communicated my consent, and women who don't do so are wrong. The enjoyment/thrill/fantasy of having a man go caveman and just take you is unfair and inappropriate to pursue.\nEdit: Thanks for the gold"], ["EXTRAVAGANT_COMMENT", 1089, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvtl74/", "sharing intimidate intimate details of your sex life with your friends without your partner's consent is a huge violation of their trust and privacy."], ["TheOnePunchMan1", 836, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvr7nj/", "Sex is one of the main reasons for anxiety... Men worry too much about their performance and size and women worry too much about their bodies and how fit they are...."], ["Varvatos_Vex", 531, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvv0q2/", "Most people can’t handle threesome. 90% of the time someone’s feelings gets hurt. They feel betrayed and drift away.\nAnother is most men who think they want to see there wide have sexy with someone else don’t. It crushes them once it’s actually happening."], ["Noeyedeer99", 482, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvvfkh/", "I am a guy and I have zero interest in putting anything in my wife's ass. She still thinks , after 15 years that I'm going to ask for anal out of the blue one day."], ["Patrollerofthemojave", 475, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvulxx/", "Calling me daddy is extremely creepy. I kinda just go along with it because I'm usually balls deep at that point but making me think about Freud's theories mid coitus turns me off quick lol."], ["AlienatedGawd", 177, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvp0nz/", "Sex is more frustrating than enjoyable, constantly wondering if she likes it, is my dick big enough, were her previous partners better, is she gonna tell her friends how bad it was... I have a ton of sexual insecurities and at the end of the day I'd rather just jerk off, I don't enjoy it like most guys."], ["The_Dragon346", 151, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvypou/", "Both partners should initiate every now and then. Not just one of the other. It makes both people feel desired and sexy, and if you’re in a relationship, it feels like less of an obligation.\nAlso, my hot take. It’s ok for a man to say no. And I think women should learn to respect that as much as it is ok for a woman to say no"], ["Kermit_Purple", 129, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvxqpg/", "You should not be labeled as a pervert/whore if you have a very High sex drive. It's ways less easy than it looks.\nIt even shatters couples sometimes. A happy sex life is normal. If your happy sex life means doing it one or several times a day, then it's okay there's nothing wrong with that.\nEdit: The opposite is also true. Having a very low sex drive isn't an issue, if your happiness in your sex life goes with doing it more rarely, or even if you're asexual, there's nothing to be ashamed of."], ["ironmans_brother", 113, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvui3x/", "There are things my woman can do to me with her hands that I can't. If you don't like handjobs, your woman is doing them wrong. Handjobs are a-mazing."], ["52316XO", 110, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvp038/", "Only recently unpopular but I can't do rough with anyone I care about. I am absolutely TERRIFIED of really hurting her by choking or the like. That seems to be the big thing with women nowadays, it is kinda fucked up honestly."], ["red_winge", 92, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvudlr/", "Not mine but have a co-worker who says this regularly: \"If the man cums, the girl is regarded as fucked\"\nSo much for caring about each others needs."], ["LeratoNull", 75, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvpv0v/", "I don't wanna have it, at least insofar as intercourse goes.\nVaginas just gross me out even thinking about them, I don't want to penetrate a dude and I don't want a dude to penetrate me."], ["DearQueenie", 69, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnw59qs/", "Please don't bother touching my boobs unless it's for your own enjoyment.  I get literally nothing from boob/nipple play, no pleasure whatsoever.  You might as well be sucking my arm.  It does nothing."], ["Just_One_Question11", 68, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvvevs/", "WHY THE HELL IS HORSE FUCKING BECOMING SO MAINSTREAM?!\nSeriously the amount of, especially animated, pornos or girls or guys getting fucked by an equine (horse) of some type is unsettling. Its not even the furries this time, its the chads and staceys that are fapping to it.\nI admit i got some pretty fucked up kinks, but when i go to the front page of a porn site, even pornhub, i’ll almost always find one ‘horse fucks girl’ thingy.\nEven my friend, who two weeks prior said i was delusional, admitted to me yesterday that he had infact seen the influx of horse porn and was sorry to have ever doubted me. But for the third time in my life, i’m not happy about being right\nWhat the fuck guys"], ["ggferick", 56, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvrcfw/", "Pegging is not as bad as you think. If done right can be a delight and fun. Never judge before trying it yourselves. My girlfriend and I agreed as her birthday gift... now is something fun now and then."], ["lig-ca", 53, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvxdo5/", "its a huge turn on when a man can be submissive. men shouldn't feel insecure about their masculinity if they're with a dominant woman, it's fun as hell to change up the roles and dynamics depending on what you and your partner are feeling.\nit makes me sad that a lot of men feel as if they have to be the dominant one 100% of the time otherwise they're somehow less of a \"man\""], ["Octopus_420", 48, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvsjlr/", "People, especially on reddit, like to say that exploring things sexually with one person is just as helpful in honing your sexual skills as having sex with multiple people.\nI do not think that's true. There's just something that comes with exploring different bodies and personalities that can't be replicated in a monogamous situation.\nSluts just fuck better. Don't @ me ¯\\_(ツ)_/¯"], ["thespookyloop", 45, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnw406i/", "Penis-in-vagina should not be the only qualifier for losing your virginity. If that were the case there are a lot of LGBT folks out there who are still virgins despite having had sex. Actually the importance placed on virginity is dumb too."], ["germanpotat-hoe", 45, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvuv1t/", "Calling your partner something like \"baby\" or \"daddy\"/\"mommy\" is really fucked up in my opinion. Like no thanks, I don't want to fuck my dad and I don't want you to think you're my dad either"], ["IShouldUpvoteMore", 41, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnw6sub/", "Watching porn as a young teen shouldn’t be normalised and the overexposure of toxic porn mindsets (perfect bodies, perfect Sex Abilities, treating women poorly, certain sexualities/identities being fetishised) is extremely damaging to teens, feeding into mistreatment (you CANT just randomly choke or slap people during sex) of their partner and self consciousness about not having perfect pornstar bodies (women getting surgery on their labia or breaststroke vs men wanting enlargement surgery or wanting body types that can’t be easily maintained)"], ["JeanChampollion", 39, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvrrtx/", "Unpopular judging by some answers in this thread: what other people do during sex is none of your business. Given that it is consensual, of course."], ["Nige1964", 38, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvvof3/", "There are no rules. As long as everyone's happy, it's all good. But, I've never understood the anal thing. I've probably had 100-odd lovers. Not one has ever asked me to stick it up her pooper and I've never had the desire to. I get that some women enjoy it and I'd comply if asked. But, no-one ever has and the idea doesn't do it for me, at all. Second unpopular opinion: Shaved pussies are creepy. I want to have sex with a woman; not a 12-year-old girl."], ["Kneejerk_Nihilist", 29, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvvtov/", "Feeling the need to shower immediately after sex is a lot like eating pizza with a knife and fork.  There's nothing wrong with it, and I understand why you'd do it, but it's just an uptight thing to do."], ["photoguy423", 28, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvwnfd/", "Society has put far too much importance on it. I think that part of the reason that we have incels is because people tend to measure the worth of a man by how many women he's had sex with. And since everywhere you look, there's sex and the sexualization of things that really shouldn't be sexualized, it's just become the be-all/end-all in some peoples' minds."], ["Ponasity", 28, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvvtlu/", "I have a prostate and i dont want anything up my ass. Trying to convince a man to do something he doesnt want to do is the same as trying to make a woman do something she doesnt want to do."], ["underslug357", 13, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnwj9pl/", "Don't do oral unless you actually want to. Don't go down on your partner if you don't actually enjoy doing it. Everybody is nervous about their genitalia at least to some extent. Taste? Smell? Is it okay? Are you sure? If you're going to half-ass paying some special attention to it, don't bother.\nEnthusiam is where most of the enjoyment comes from. Pleasuring your partner shouldn't be some kind of personal sacrifice that you have to endure. Find something else you could do for them if you don't like oral.\nEat that dick/pussy/whatever like it's your last meal on death row, or don't bother."], ["hellokittystan", 13, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvyi90/", "Might be controversial but sex is tiring and causes too much anxiety. I imagine people who don’t think this way have a lot of energy, strength, and an obscene amount of confidence"], ["Digibollocks", 6, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnvxwq6/", "Men do want and feel an emotional connection from sex. They tend not to admit it, because it's cooler to say it meant nothing and it was a conquest to his guy friends."], ["Matt01123", 5, "https://www.reddit.com/r/AskReddit/comments/g4727o/whats_your_unpopular_sex_opinion/fnwc9p5/", "People who build their entire life and identity around their kink are no different than those people who build their entire lives and identities around watching anime or building model railroads."]]]