["What are some huge GREEN flags that are often overlooked?", "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/", [["feed-me-your-secrets", 37762, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et2quf5/", "When you’re not afraid to disagree with them, because you know they’ll actually listen rather than just hurting you.\nEdit: thanks for the gold and silvers, kind strangers!"], ["ratsono", 26232, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et2py0v/", "When someone admits to their mistake/owning up to it and does not make an excuse for failing, but trying to better themselves through that experience, being positive about it."], ["Bukkake_Bakery", 16634, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et2niu0/", "General mindfullness, the little things you don't really notice if you don't pay attention. Pushing a chair in after sitting in it, asking questions and being involved with you. You can learn a lot about somebody by paying attention to how they listen, and having a partner that listens is an absolutely amazing feeling. There is a huge gap between \"being aware of what you're saying\" and understanding what you're saying. A good listener is priceless."], ["whitechiligal", 13247, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et3dqqw/", "My boyfriend will sometimes be upset and start a sentence with \"Well you..!\" And then takes a second and starts over with \"I feel\".\nI notice every time and I try and be the same way."], ["DuTag163", 12982, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et359t6/", "When you're talking with someone and they remember what you're talking about or were talking about at one point.\nAnother one is when they remember that you've done certain things with them and bring it up from time to time.\nOther than that, it's the normal stuff that shouldn't be overlooked or the little things I guess."], ["anarchy420swag", 8675, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et2un6q/", "Treating people you don't have to treat respectfully, with respect.\nI'm currently an Uber Eats driver and I've found the huge contrast in the manner  hospitality staff treat me when I'm picking up orders, compared to when I'm a customer. It seems because I'm not a paying customer, service staff seem to think it's okay to treat me like shit or a lesser individual."], ["min2themax", 6016, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et35hjm/", "When someone is quick to give credit and slow to place blame.\nSuch a great sign that someone will celebrate other people and appreciate / acknowledge them, and will be really kind and benevolent when something bad happens."], ["realfreddieamiri", 4295, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et32nsi/", "When they show genuine interest in you or what you’re doing, they listen to you go on and on about shit they don’t care about and don’t understand because they know you enjoy talking about it."], ["SlytherKitty13", 2500, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et314tg/", "Putting their rubbish in the bin when they leave a place like maccas/hungry jacks/kfc/fast food places. Like honestly, a child knows how to put their rubbish in the bin, why are you leaving your rubbish everywhere if you're a grown adult??"], ["Waldkatzl", 2462, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et2n82p/", "How they treat ex-partners altought they (exes) did them wrong. No feelings of wanting \"revenge\". One of the reasons I decided to move in with my now boyfriend.\nEdit: little clarification. This isn't about shit talking in private, that's emotional and understandable if something nasty happened. This is about what the person decides to focus on then and if they deliberetaly try to destroy and ruin their exes life. Threatening and stalking and just trying everything to make it extra hard when they just want to move on. And I think this says a lot about a person in general and about how they deal with rejection and failure."], ["JabTrill", 2357, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et32uvr/", "Good communication. If you can communicate really well with someone, that is HUGE. Quality communication between two people can be way more important in a relationship than compatibility and is huge part of good chemistry. For example, one of my friends has gone on a couple dates with this one girl and the first date they talked for 3 hours and the second date they talked for 4 hours, but he's not sure if he wants to see this girl again. Like what?"], ["VelvetDreamers", 2081, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et2tdf4/", "Someone who's meticulously careful with a borrowed possession and returns it in pristine condition. Too many people have a cavalier attitude and just presume it's a frivolity but this solicitous person is grateful and returns it punctually because they know it's their implicit obligation. They care about how you'd feel if something was returned damaged."], ["Yellowbug2001", 1506, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et3e3vt/", "Admitting when they don't understand something and asking questions about it until they do.  A few years ago I was at a party with a friend of mine, and another friend-of-a-friend who is a physicist who worked for a startup that produced specialized magnets for quantum computing.  My friend asked the startup guy about his work, and he explained it, and everybody else in the room just nodded and acted like they knew what he was talking about, but she said, \"I don't understand, can you explain that a different way?\" And he did, and then she kept asking questions for quite a while, and by the end of it we actually all DID understand what his company did instead of just being polite and pretending we did, and it was super interesting. A couple of people thanked her afterward basically for having the self-confidence to admit she didn't have any clue what he was talking about and not being afraid it would make her look dumb, because the rest of us were all content to pretend we knew instead of actually taking the initiative to find out. I respected her so much for that."], ["ButtMunchyy", 1333, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et30k2q/", "Smiling when you make eye contact with people briefly. Then you mutually smile back.\nSome old guy said \"hey\" to me while we were passing. That was just magical. Makes me want to do that myself."], ["fruitytrailmix", 1098, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et3ahly/", "I noticed once I got into my 30's that all my friends would break up over green flags.\n\"OH she was doing MYYY dishes! Like bitch back off!\"\n\"He was just always asking me how I was doing and trying to be deep, so annoying.\"\n\"She just was too something...idk, she got me a birthday card and said I love you.\"\n\"He kept trying to see me every week. Then when I said no, he didn't call me for a whole week!\"\n\"She wanted to date, but she said she also was focused on working 5 days a week. I need a commitment...to ME.\"\nEdit: OK, a handful of comments about why I am friends with them if these people are so horrible/terrible/selfish etc.\nI have worked with many of them for over a decade, and as anyone knows who has held down a long term job; sometimes you make friends with people (even if they have character-flaws) if you see them everyday for years.\nThese people all have individually donated thousands of their dollars to local charities, and all have volunteered to help with adopting struggling families, domestic abuse survivors, childrens charities, etc. I have watched them pull out hundreds of dollars from their wallet on the spot to help support a co-worker who is sick, injured, or just had a child and have to take un-paid time off. Most of them will drop anything they're doing to come and help you if your in bind (a friend came and towed me, 120 miles from where we live). Another not only fixed an exhaust issue on my truck, but fabricated a brand new flow-thru and helped install it and refused payment of any kind.\nPeople can be selfish, shallow, rude, etc. They can also be incredibly generous and kind at the same time. We all have character flaws."], ["Trektopus", 885, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et2jdn0/", "I was told many years ago that when you're on a date with someone and you bring them to your vehicle and let them in the passenger side door, if they lean over and unlock the driver side door for you it means they actually care about you. ( This was of course before automatic door locks were made standard in most cars."], ["lindsaybethhh", 874, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et3bbt8/", "Honesty early on. When my husband and I started dating, I told him how much I wanted to see a certain movie, and for one of our first dates, he invited me over to watch said movie, and said he’d make dinner for me. I was a little nervous to go, because I figured he’d meant “watch a movie”... I get inside, he’s got pasta cooking, and the movie is all set up and ready on his TV. We ate (terrible) pasta, watched a movie, and that was the day I decided to keep seeing him (but that I’d do the cooking)."], ["Space_Floof", 719, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et382a5/", "I never realised what I was missing until I got with my current gf, it's being able to talk about bad stuff. I had a breakdown and apologised for it, the first thing she told me is to please never apologise for feeling bad. It was such a special thing for me, and when I told people about this they told me this is how it's supposed to be. Being able to feel bad and not be afraid they'll be any less in love with you because of it.\nMy very first silver! I feel honoured~"], ["thebluewitch", 541, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et36l74/", "Being polite and friendly when they see their exes.\nEven better? Being polite and friendly with the ex they share parenting with. I've seen way too many people shit talk the other parent in front of their kid(s)."], ["TheRealist157", 375, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et3d7hy/", "Being okay to tell you that they're nervous or scared.\nIf a guy tells me he's either nervous or scared of something it usually means that they like to enough to be vulnerable and open up about how they feel.\nUsually guys get made fun of for being nervous and even more so for being scared, but I see it as a total green flag!"], ["lunadarkscar", 351, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et3iig3/", "Asking you how you're doing/feeling. It was weird for me to go from a moderately abusive man (and not even being bothered by it! It was normal) to an amazing man (my husband). He asks me how I am, and genuinely wants to know. It's done my mental health wonders to know that he actually cares about me, and it's the smallest thing he could possibly do.\nAnd, since he's also a redditor... Husband, if you're reading this, I love you!"], ["therealsix", 338, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et3ko70/", "My 8 year old saw a shopping cart someone left in a handicapped parking spot and was upset and commented on how rude that was and what if \"someone who couldn't walk couldn't park there now\". We parked and she walked to the shopping cart and walked it back to the store.\nI'd say that's a big proud green flag for me, I love her."], ["sendmecutecatpics", 337, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et3gl0t/", "Asking if you ate today. I know it's super simple but it shows they genuinely care about you and want you to know you're happy and have a full belly!\nOr they're planning on eating you. It's a 50/50."], ["_A_ioi_", 240, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et37m9g/", "Respecting boundaries without being told to respect them. The friendly guy having a normal conversation  with you is often the better bet than the guy who is hitting on you."], ["bunnixie", 180, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et3j335/", "Taking care of you in small ways without thinking about it. Like, yea its a no brainer to take care of someone who's sick. You bring them cough drops ane chicken noodle soup, the whole thing.\nBut the things that matter to you as an individual, and they don't even notice that they care about it is a big green flag.\nExample1: I have a skin picking compulsion (gross, ik) and I was obsessing over my skin while on the way to the store. He doesn't usually say anything about it or notice me \"acting up\" but this time he did and said \"Bunnixie, stop. Your skin is fine.\" And when I kept looking at it he just casually closed the mirror and kept driving. Like it wasn't any big thing to him, just something that needed to be fixed.\nExample2: I was screaming at him cause he was about to mess up my wet nails, it was playful but I still screamed bloody murder cause I worked hard on my nails. He kept trying to touch them and was tickling me. He said \"Bunnixie you're gonna hurt your voice!\" And was actually genuinely concerned. I'm a vocalist and he knows how much singing means to me.. but I didn't realized he cared like that."], ["ivelynn", 95, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et39fps/", "Not gossiping about your relationship to other people. I realized how lucky I was that despite whatever problems we were going through, he would never talk shit to our friends. I had a harder time, and would often vent to my girlfriends. But it made me realize maybe I could be a little more private"], ["t8rtrott", 93, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et3ai7i/", "When someone takes care of themself emotionally during difficult discussions (rather than reacting and personalizing what you’ve said). This requires a strong ego and it’s honestly rare. If someone can do this, KEEP THEM"], ["Amanda30697", 66, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et3g1w5/", "When you can be together without interacting. For example my boyfriend and I love hanging out together and watching anime. But when we see one another it’s also enjoyable to know they’re with you but you can do your own thing and still enjoy their company. Perhaps you both scroll through reddit and pause to show a funny meme to each other. In that scenario you’re just calmly relaxing and enjoying their presence."], ["sfgiantsfan3", 42, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et3ix5v/", "One of the first things I realized about my now-husband was that he never gossiped. Like he just never has anything mean to say about people. It really helped me stop being such a gossip over the years haha."], ["lucyfrost", 41, "https://www.reddit.com/r/AskReddit/comments/c9suu6/what_are_some_huge_green_flags_that_are_often/et37wda/", "If you live with people, being nice to your roommates. Potential partners/hookups have some incentive to be nice to your friends, because they know you’ll probably listen to your friends if they tell you your partner sucks. But a roommate might not have that much influence over you, so a person who’s just faking being considerate might drop the act around them. When we were still casually dating, my now boyfriend brought my roommates snacks just because, always checked if we were watching the TV too loud, etc. and years later he’s still one of the most considerate people I know."]]]