["What’s something that seems fun, but is actually terrible?", "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/", [["crystalsermon", 3270, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eue3dp4/", "Driving to the beach if it's a long drive. Driving 3 hours one way to get sand encrusted and soggy just to drive another 3 hours back is not exactly going to leave anyone in a good mood."], ["i_fuckin_luv_it_mate", 2967, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eue7hwm/", "La Tomatina.\nMassive tomato fight in a small village in Spain. 20,000 participants in a narrow street, drunk,full bladders packed in like sardines. National guard is there to monitor. Then they force the trucks through to drop tomatoes on you to throw at others:"], ["zeppelinonnpr", 2118, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/euebby8/", "Being a swinger. The idea of a ton of novel sex sounds great but it doesn't really work that way. You have to spend all your time looking for people to hook up. Get connected enough that a meet up can get scheduled. More scheduling. Crappy sex with strangers you may or may not really find attractive. Awkward emotional stuff to    ' work through' with your partner. Oh yeah and your partner is having sex with people ypu may find simply awful. In the end it's all logistics and embarrassing situations."], ["PepurrPotts", 1965, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eue5b51/", "I'm gonna get hate for this, but going to Mardi Gras in New Orleans. The idea of it is terrific, and it's certainly an adventure. But I went when I was 19, and it was incredibly chaotic and overwhelming. I had college friends who continued to go every year, but once was definitely enough for me.\nEDIT: I'm getting some flack for the fact that I was only 19 when I went. Please trust me that this did NOT matter in New Orleans back in 2000. I looked about 15, and I still got served everywhere I went, without getting carded. Me not having fun had nothing to do with whether or not I was sober!"], ["mrsputtbunyon", 1909, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eue60bx/", "Picnics/eating outside. Especially if it’s windy. If it’s not windy then there are always bugs."], ["meatfrappe", 1638, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eueart4/", "Attending an NFL game.\nThe NFL's dirty little secret is that the gameday experience is total shit compared to grilling up some food at your house, cracking open a bunch of good beer, and watching with your friends on your big screen TV. Being a stay-at-home fan with friends and shared food/drink is better in every way."], ["peachplastic", 1440, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eueuofv/", "when i was a kid, my dad worked at the local deli in town to make some cash on the side and i thought it was the coolest job EVER. i loved walking in and seeing him work and even though it was making sandwiches and prepping catering orders, i always like “when i’m old enough to get a job that’s what i’m gonna do!”\nwell, i turn 14 and the bosses offer me a job almost as soon as my birthday came around. i used to think working in a restaurant was the coolest thing in the world.... until i worked in food service and it actually is the worst thing ever. nothing better than working long hours for minimum and being screamed at by rude and angry customers.\ni think what made it seem cool was just that my dad is a generally calm and happy guy, so he made working a pretty difficult job seem fun because he had such a calm demeanor about it. for that i give him a ton of respect\nEDIT:// wow didn’t expect this to get this much notice. to clarify some things: i didn’t hate my job. it was a lot of hard work for minimal pay but the bosses always treated me well. but i don’t have the patience to handle it for as many years as he did. he was able to deal with a lot of stuff with a smile on his face that would normally cause a lot of people (like myself) to absolutely lose their shit. it was a great job, but it wasn’t the perfect job that i imagined it as when i was little"], ["THofTheShire", 1075, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/euenrdg/", "Going to the fair: Pay to park. Pay to get in. Pay for rides. Pay for special events. Pay for overpriced food.\nI literally just paid $97 for my family of five to eat dinner and wander around."], ["theshoegazer", 1036, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/euen6os/", "Renting a paddleboat. You see them sitting there and think it would be nice to get out on the water, but you quickly realize that it's a very inefficient way to power a boat and you just return to the dock 20 minutes after you set off."], ["Fibwick", 981, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eue6rx0/", "Going to parties. I have no friends and feel lonely a lot, but if I ever go to a party or anything it’s fucking agony."], ["WitchyFantom", 462, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/euf1kmx/", "Having huge breasts. Back pains, stares, clothes are harder to find, bras are hard to find in your size, and regular shirts on you make you look like risque."], ["buttpuckering", 442, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eue37fs/", "Drinking and partying at bars and clubs.\nI go hard at a bar once a year, on my birthday, when all I want is for my friends to make sure I don't wander too far. I usually have a great fucking time dancing, socializing, and probably making an idiot of myself at karaoke. I wake up the next day feeling like shit every time and that's all i need to remind myself why i don't drink."], ["mxrbids", 365, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/euefexx/", "I'm probably going to be argued with here but.. Being an artist(or art major)\nImagine this; you get to create a lot of shit, there's a fictional world at your fingertips. Sounds nice, right?\nWell then imagine some BITCH named Bethany goes and repost(without credit, btw) YOUR work on her Insta to promote her shitty MLM who is just about as annoying as some elder bitch named Shannon who fucking gives out raisins and pencils(if you're lucky, peppermints) on GODDAMNED HALLOWEEN and no matter how much you tell the bitch to put it down she won't because \"what you gonna do? Uwu reppooort mwe? Well dat just pwoves how much of a wittle bwitch you are. You warely wowked on it! Its just a shitty dwawing! I could do dat with mwy eyes cwosed! Uwuwuwuuwu\"(DO IT YOURSELF THEN, BETHANY, YOU FAT MIDDLE-AGED BITCH.)\nOr; You're getting a little stressed, reasonable right? Every career induces stress once in a while. Well just as you think this some BASTARD named Cleetus Hubert Jr. burst through your wall, completely busting it down with his huge ass beer belly, and he cries like that of an eagle, letting his patriotic pride sink in like the feeling of your impending doom, \" OH YOU THINK YOU'RE STRESSED? WELL I SHOVED A CACTUS UP MY ASS WHILE I MOTORBOATED SHREDDED WOOD. BUT NO I DON'T DESERVE TO BE STRESSED BECAUSE SOME ART MAJOR IS. SO LET ME FIX YOU UP A NICE CUP OF WATER TO RELIEVE YOUR NERVES, YOU LITTLE BITCH.\"\nhello and thank you for coming to my Ted talk.\nEdit: Hello again! I see some people worrying if the Bethany situation is real, and fortunately I can say no. Well... Not anymore."], ["bergamotwaters", 363, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/euetwsx/", "having lived in a coastal state all my life, it never fails to baffle me how people flock to the beach on a 100 degree scorcher of a day. burning hot sand! swarms of people with little to no regard for personal space! sweat dripping everywhere! not my idea of summertime fun, but to each his own. on a side note, whenever I tell someone my ideal time to go to the beach is in september/october, they look at me like i'm a three headed dragon."], ["Responsible_Rhubarb", 356, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eueo7il/", "having a one night stand, (duno if its just me)  I feel dirty afterwards and sort of hollow, like i got nothing from it after the deed with my post nut clarity"], ["Sopadecaracolyeah", 351, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/euen7mz/", "Taking care of a cute dog that is not yours and seeing how he eats all your precious new blankets"], ["gutmii", 306, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/euemv7j/", "A job that involves travelling pretty much all the time. People will be like \"oh, you get to travel and visit all these new places!\". Yes, that and not having a stable home, hotel living, not being able to even buy a three pack of something or do groceries since you'll be traveling again next week. It gets exhausting!"], ["easilyrecognized", 293, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eue0f93/", "Staying up all night, then crashing the next day.\nAlso happy cake day my friend"], ["possumhomie", 236, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/euemc53/", "Going to any type of convention? A couple days after the actual convention you'll think that you had loads of fun but while at the actual convention you're utterly miserable. Hungry, thirsty, feet hurting, out of money, tired and most likely bored if you're waiting in line for any signings or panels. Also you're probably very uncomfortable if you are cosplaying or very worried if a piece is about to break, if you bought action figures or art you're probably annoyed about having to carry it.\nIn conclusion: conventions sound fun on paper, conventions seem like they were fun after a day or two has passed, but while you are actually there it's the embodiment of hell."], ["greenline_chi", 182, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/euebmfw/", "Music festivals.\nThey’re hot, crowded, the lines are long for both drinks and the bathroom (aka porta-potties, another strike) so you actually spend like half your time in one line or the other while you remember you paid a couple hundred dollars to do this.\nAlso, because it’s so crowded you can’t really even go from stage to stage completely defeating the purpose of having all the acts in one place. If you want to see the headliner you have to camp out at that stage all day.\nIf you genuinely want to hear a bunch of bands, music festivals are not the place for it. In reality the bands are just background music for people who want instagram pictures of them in their flowers crown."], ["Eddie_Hitler", 140, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eue8pak/", "Doing nothing at work all day and goofing off.\nNo, that's horrendous and drives you insane.  I'd rather be stressed to the point of blowing up and having too much to do, over having nothing to do at all."], ["monsterlynn", 101, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eue9kyp/", "Going to the Drive-In.\nSure it has nostalgic value but once you're there you realize it's watching a movie in your car with shit sound, sub-par bathrooms, surrounded by rowdy people, all while at the mercy of the weather and millions of mosquitoes that can't believe their luck."], ["waitingintheshadows", 78, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eueugzs/", "Shopping for myself. I get all pumped up, then I get there, or to the website and about 10 minutes in I'm done. I envy (kind of) those other women who can go store to store picking out crap and try them on, making a purchase, but it's just exhausting to me. I rarely buy clothes for myself, but it's not because I don't care about my appearance I just genuinely hate shopping. My mom and sisters are like shopping pros, loads of shoes, clothes and I'm still wearing flip flops I bought from Walmart 3 yrs ago for $8. I'm trying to get myself to buy a couple of things a year for myself to maybe get into it. Oh, even my mom and sister has offered to buy me something online and I decline because I don't want to look at Kohl's to peruse their clearance crap. No thank you. (I take care of my clothes and shoes, it's not like I'm walking around looking like a ragamuffin. And I like t-shirts/jeans kind of look so I look lazy, not crazy, even if I'm crazy.)"], ["Tater-Tot_917", 56, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/euehjrp/", "Adult life. When I was a kid I thought being older, driving, doing my own thing, etc. would be so much dang fun. Now im just tired and dread getting out of bed in the morning for my 2 hour commute to class....\nGranted there are bright sides, like the freedom, my Fiance, etc. but its still not nearly as awesome as I thought it would be when I was a kid."], ["TallPinePhoenix", 56, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eue9ups/", "Painting. When I was younger I had this vision of getting together with friends and drinks and pizza and music all coming together to paint the house..yay good times.....we do have the pizza and music and beer but it is actually alot of work that requires some level of detail."], ["ThePurestAmoeba", 38, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eueu8ee/", "Eating meals outside. My family just now decided that the birthday celebration is going to be eaten in the backyard. We have a serious ant infestation back there and we all can't stand them. I don't know why they are doing this."], ["TobiasDid", 33, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/euemzly/", "In my option, paintballing. Seems like it will be fun before you go, and seems like it was fun after the event, but weirdly unenjoyable whilst it’s happening."], ["ComprehensiveAmoeba9", 28, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eueuouj/", "Getting blackout drunk. Having to bug your friends by asking so many questions about what you did. Waking up having no idea what day and time it is, where tf you’re at, and can only remember puking your guts out. And the awful hangover, never again. Only on my 21st haha"], ["BlackMetalDash", 23, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/euettce/", "Being a videogame QA tester.\nI've had a handful of people aspiring to be video game testers, thinking that testing games as in 'playing them' - and I mean games only - all the time is a quick and easy way to make your hobby your job while making money in the process.\nThe reality is much different and not nearly as fun as one may think.\nYou will be playing the same boring part in a game over and over and over again,\nlet along the game might not be even that good to begin with.\nSoon enough you'll be completely burnt out, sick of playing games."], ["TheElusiveBushWookie", 18, "https://www.reddit.com/r/AskReddit/comments/cg1xr0/whats_something_that_seems_fun_but_is_actually/eueqsld/", "Living in a little village on a mountain. Everything is super expensive, and everyone’s an alcoholic"]]]