["Waiters, what dating disasters have you witnessed?", "https://www.reddit.com/r/AskReddit/comments/g4a8g7/waiters_what_dating_disasters_have_you_witnessed/", [["RipGuts415", 209, "https://www.reddit.com/r/AskReddit/comments/g4a8g7/waiters_what_dating_disasters_have_you_witnessed/fnw7qu2/", "I was a waiter at a very famous, upscale restaurant and a gentleman approached the maitre’d requesting someone take pictures of him proposing to his girlfriend. Since I was the closest asshole to the maitre’d I was tasked with performing this duty.\nAfter stalking the table for a solid hour the moment was inevitably approaching. I set up at an angle she couldn’t see me and when he busted out the ring I started taking as many pictures as I could. Anyone who has tried to capture a once in a lifetime moment on camera knows that you’re not really watching what’s going on, you’re just trying to frame the moment. After about 20-30 pictures I slowly realized that she was declining the proposal and the scene was quickly degenerating into a Five Alarm dumpster fire. However I was far enough away that I couldn’t hear what was being said and couldn’t be sure of what was transpiring so I continued taking pictures just in case. Finally I stepped back and watched the scene unfold in reality as she stormed out of the restaurant in embarrassment and he scrambled to pay the bill and chase after her.\nHe’d requested that I use my phone and send the best pictures to him. Needless to say he never approached us for the pictures and I have about 100+ pictures of a wedding proposal gone wrong somewhere deep in my iCloud photo bank..."], ["TheRelevantElephants", 129, "https://www.reddit.com/r/AskReddit/comments/g4a8g7/waiters_what_dating_disasters_have_you_witnessed/fnw9xs0/", "I used to bartend at a yard house in the beforetimes\nYard house is a corporate place that's basically a nicer sports bar with a ton of beer on tap with stupid, giant novelty glasses. I had a couple at the bar during happy hour drinking from one of the big glasses and they ordered some onion rings that were half price, he jokingly proposed with an onion ring and she started laughing and jokingly said yes\nThen he busted out an actual ring.....she wasn't laughing anymore."], ["REDxSAM", 108, "https://www.reddit.com/r/AskReddit/comments/g4a8g7/waiters_what_dating_disasters_have_you_witnessed/fnwfha1/", "Not a waiter but I saw a first date next to me. In short, girl states she has an allergy to pineapple, guy says OK in a \"I don't believe you\" kinda way. At some point he scraped some pineapple glaze off his dessert and onto her spoon when she popped outside to make a call. She comes back and eats without noticing too much, has a severe reaction. Guy freaks out and tries to run but gets stopped by my girlfriend who is suspicious of him. Manager administers the girls epipen and ambulance & police are called. Absolute clusterfuck situation."], ["bodhisattva2424", 83, "https://www.reddit.com/r/AskReddit/comments/g4a8g7/waiters_what_dating_disasters_have_you_witnessed/fnwdwlq/", "I was bartender at a country club in college and I watched a woman curse her husband out at their table because the husband kept flirting with the waitress. She got REALLY loud and walked out. Keep in mind this was a nice restaurant at an upscale country club. The waitress felt it was all her fault but she told me the guy had been coming in there often and tipping her 100% of the bill everytime."], ["PurpleCu7", 54, "https://www.reddit.com/r/AskReddit/comments/g4a8g7/waiters_what_dating_disasters_have_you_witnessed/fnwe4bs/", "Nothing particular but I see a lot of couples that spend their entire dinner time without talking and just staring at their phones. Doesn't necessarily mean they are in a bad relationship but it makes me sad for some reason."], ["willowmillows", 47, "https://www.reddit.com/r/AskReddit/comments/g4a8g7/waiters_what_dating_disasters_have_you_witnessed/fnw9zaf/", "the place got extremely busy but these two 15 year old love birds had been sitting on a table for 8 for several hours just ordered one milkshake. Had to politely asked them to leave as it was clear they were just looking for a safe PDA spot together away from their parents."], ["Tyaltir", 35, "https://www.reddit.com/r/AskReddit/comments/g4a8g7/waiters_what_dating_disasters_have_you_witnessed/fnwggtt/", "I was a bartender at a restaurant that specializes in seafood.\nThis couple came in and it was obviously a first date, they were both very awkward.\nThey ordered a few dishes, one of them was a dish with Crystal Shrimps (peeled, without the actual hard shell, but still with head and whisker things and stuff).\nThe guy proceeded to eat the entire shrimp. Like, head and tail and everything.\nIt was as crunchy and horrible as you can imagine."], ["Evil_frenchie", 19, "https://www.reddit.com/r/AskReddit/comments/g4a8g7/waiters_what_dating_disasters_have_you_witnessed/fnwjs53/", "I'm a waitress in my father's restaurant. It's not that big, but we're usually full during week-ends. A lot of couple come here cause it's kinda \"chic\"  for a french restaurant.\nAnyway, once there was a couple,  early 30s. The dude arrived earlier than the girl, so i though it was something like a date but eeh no... The girl ordered everything, she chose all the dishes, the dessert and even the wine without even asking the guy what he would like to have. They both didn't talk, only said good evenning, weird for a date. But when i came at their table to server the wine, they started to argue about their relationship. The dude was convinced that she cheated on him, and you know what, she admitted that and said very loud that he was bad in bed... at this moment any single cell in my body was cringing They kept arguing for 10 minutes until i decided to stop them, coz they were almost yelling and so disturbing the ~15 people in the restaurant. The woman asked if she could have an other bottle of wine, and she left within 5 minutes WITH THE BOTTLE. I felt so bad for this guy that i gifted him his whisky-coca"], ["proteinstains", 14, "https://www.reddit.com/r/AskReddit/comments/g4a8g7/waiters_what_dating_disasters_have_you_witnessed/fnwfivf/", "I wouldn't say it was a disaster but once my coworker came up right next to me with a whole cabaret full of drinks (mostly pints of beer). Then, I suppose she tripped or lost her balance or something because suddenly the content of her cabaret was all over me. I was dripping with beer and sticky drinks... right in front of my boss. She said not to worry, she saw the whole thing and it was an accident. I just asked her if she would have my back in case some customers complained that I smelled like alcohol. ¯_(ツ)_/¯"], ["imk", 10, "https://www.reddit.com/r/AskReddit/comments/g4a8g7/waiters_what_dating_disasters_have_you_witnessed/fnwkydl/", "Couples fight in restaurants a lot. That or maybe they argue everywhere. I couldn’t say. I worked as a waiter for years and I could not begin to count the number of arguments I saw.\nBut one guy comes to mind above all of them. This guy must have been 50-60 years old and got angry with his lady. He actually threw a snit and stomped off and was wandering around the restaurant and looking back at her and scowling. It was like a child throwing a temper tantrum, but most children aren’t even this dramatic usually. It was nauseating to watch."], ["yellowscarvesnodots", 1, "https://www.reddit.com/r/AskReddit/comments/g4a8g7/waiters_what_dating_disasters_have_you_witnessed/fnwpa2c/", "Not a waiter, but I saw a couple at a dinner and couldn’t shake the feeling that this was an escort scenario. She was clearly out of his league and much  younger - so far so good. But then it became obvious that he did most the talking, bragging really and she laughed at every single attempt of a joke. It was awkward to watch and became so apparent that our entire table noticed (I was out with three friends, we sat next to them). I know this could also just be a golddigger situation but there was something about them that made it feel  like she was professional and he had no clue what he was doing."], ["tattoboy97", 1, "https://www.reddit.com/r/AskReddit/comments/g4a8g7/waiters_what_dating_disasters_have_you_witnessed/fnwqym2/", "My boss broke up with his wife while I was working for him and I was witnesses of all the drama they had in the kitchen , at the end of the day I just finished my shift and said “thanks for everything mate , it was pleasure for me to work for you” and I walked away from that place .."], ["Ive_got_spirit", 1, "https://www.reddit.com/r/AskReddit/comments/g4a8g7/waiters_what_dating_disasters_have_you_witnessed/fnwq1ra/", "I worked fine dining in Vail Colorado. I once saw a lady throw red wine all over a guys shirt and leave. He sat and continued eating his spaghetti plate. No fucks."], ["Djdanny90999", -3, "https://www.reddit.com/r/AskReddit/comments/g4a8g7/waiters_what_dating_disasters_have_you_witnessed/fnwlvg9/", "I was getting ready to pick her up and then she jumped out the window because i changed what i wanted to do for the date"], ["IbNotEvenOnce", -40, "https://www.reddit.com/r/AskReddit/comments/g4a8g7/waiters_what_dating_disasters_have_you_witnessed/fnwfydq/", "Who ever is reading this I am sorry to ruin your day... but.... you just lost the game"]]]